app/views/businesses/new.html.erb

SELECT "tags".* FROM "tags"
---
              <div class="tags-grid" style="display: grid; grid-template-columns: repeat(auto-fill, minmax(120px, 1fr)); gap: 10px; background: #2b3035; padding: 15px; border-radius: 6px; border: 1px solid #495057;">
                <%= f.collection_check_boxes :tag_ids, Tag.all, :id, :name do |b| %>