app/views/devise/registrations/new.html.erb

  <div class="tags-grid" style="display: grid; grid-template-columns: repeat(auto-fill, minmax(130px, 1fr)); gap: 10px; background: #222; padding: 15px; border-radius: 5px; border: 1px solid #444;">
    <%= f.collection_check_boxes :tag_ids, Tag.all, :id, :name do |b| %>
---
SELECT "tags".* FROM "tags"