app/views/shopping_carts/show.html.erb


        <% if @shopping_cart.items.any? %>
---
SELECT "items".* FROM "items" INNER JOIN "cart_items" ON "items"."id" = "cart_items"."item_id" WHERE "cart_items"."shopping_cart_id" = 4
SELECT 1 AS one FROM "items" INNER JOIN "cart_items" ON "items"."id" = "cart_items"."item_id" WHERE "cart_items"."shopping_cart_id" = 4 LIMIT 1


      <% if @shopping_cart.items.any? %>
---
SELECT 1 AS one FROM "items" INNER JOIN "cart_items" ON "items"."id" = "cart_items"."item_id" WHERE "cart_items"."shopping_cart_id" = 4 LIMIT 1

                <tbody>
                  <% @shopping_cart.items.each do |item| %>
---
SELECT "items".* FROM "items" INNER JOIN "cart_items" ON "items"."id" = "cart_items"."item_id" WHERE "cart_items"."shopping_cart_id" = 4

            <span class="fs-4">Total a pagar:</span>
            <span class="fs-2 fw-bold text-warning">$<%= @shopping_cart.items.sum(:cost) %></span>
---
SELECT SUM("items"."cost") FROM "items" INNER JOIN "cart_items" ON "items"."id" = "cart_items"."item_id" WHERE "cart_items"."shopping_cart_id" = 4