app/views/items/_form.html.erb

SELECT "tags".* FROM "tags"
---
        <%= f.label :tag_ids, "Categorías del Producto (Puedes elegir varias)", class: "form-label text-white" %>
        <%= f.collection_select :tag_ids, Tag.all, :id, :name, {}, { multiple: true, class: "form-select bg-dark text-white border-secondary", style: "height: 120px;" } %>