app/controllers/businesses_controller.rb

INSERT INTO "businesses" ("username", "comuna", "email", "password", "category", "created_at", "updated_at") VALUES ('aaaaaaaaa', 'aaaaaaaaa', 'aaaaaaaa@aaaaaaaa', 'aaaaaaaaa', 'aaaaaaaaa', '2026-05-30 20:49:29.928877', '2026-05-30 20:49:29.928877') RETURNING "id"
---
  def create
    @business = Business.new(business_params)

    respond_to do |format|
      if @business.save

UPDATE "businesses" SET "category" = 'olaaa', "updated_at" = '2026-05-30 21:23:08.365138' WHERE "businesses"."id" = 7
---
  def update
    respond_to do |format|
      if @business.update(business_params)

SELECT "businesses".* FROM "businesses" WHERE "businesses"."id" = 5 LIMIT 1
---
    def set_business
      @business = Business.find(params.expect(:id))