app/controllers/items_controller.rb

  def create
    @item = current_business.items.new(item_params)

    if @item.save
---
INSERT INTO "items" ("photo", "name", "description", "categories", "cost", "owner_id", "created_at", "updated_at", "deal", "discount_percentage", "stock") VALUES (NULL, 'prueba', 'test ingredientes', NULL, 100, 4, '2026-05-31 17:34:09.350254', '2026-05-31 17:34:09.350254', TRUE, 20, 4) RETURNING "id"

  def update
    if @item.update(item_params)
---
UPDATE "items" SET "name" = 'nombre', "description" = 'descripcion', "updated_at" = '2026-05-30 21:35:43.447867' WHERE "items"."id" = 7

  def set_item
    # 4. EL ESCUDO DEFINITIVO: Al buscar dentro de 'current_business.items',
    # si un negocio intenta poner en la URL la ID del producto de otra tienda,
    # Rails arrojará un error 404 (Not Found) automáticamente por seguridad.
    @item = current_business.items.find(params[:id])
---
SELECT "businesses".* FROM "businesses" WHERE "businesses"."id" = 7 ORDER BY "businesses"."id" ASC LIMIT 1