app/controllers/shopping_carts_controller.rb

DELETE FROM "cart_items" WHERE "cart_items"."id" = 3
---
  def empty
    if @shopping_cart.user == current_user
      # Borra las conexiones de los productos con este carrito
      if @shopping_cart.respond_to?(:cart_items)
        @shopping_cart.cart_items.destroy_all

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."shopping_cart_id" = 4
SELECT "items".* FROM "items" WHERE "items"."id" = 5 LIMIT 1
INSERT INTO "cart_items" ("shopping_cart_id", "item_id", "created_at", "updated_at") VALUES (4, 5, '2026-05-30 21:19:51.719684', '2026-05-30 21:19:51.719684') RETURNING "id"
---
  def add_item
    @item = Item.find(params[:item_id])

    # 1. Buscamos el carrito del usuario actual. Si por alguna razón no tiene uno, se lo creamos al instante.
    @shopping_cart = current_user.shopping_cart || current_user.create_shopping_cart

    # 2. Añadimos el producto a la colección de ítems del carrito
    @shopping_cart.items << @item

SELECT "shopping_carts".* FROM "shopping_carts" WHERE "shopping_carts"."id" = 4 LIMIT 1
---
  def set_shopping_cart
    @shopping_cart = ShoppingCart.find(params[:id])