app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "email", "password", "role", "badges", "created_at", "updated_at") VALUES ('hola', 'siuuu', 'aaa', 'kk', 1, '2025-10-02 00:05:56.771652', '2025-10-02 00:05:56.771652') RETURNING "id"

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "role" = 2, "updated_at" = '2025-11-18 02:49:42.124326', "encrypted_password" = '$2a$12$5iBZfSHxKB6hewRJMSAGMuS7.GLE7ZKsarSTFCkznHY6U3CLpdeuW' WHERE "users"."id" = 34