app/views/layouts/application.html.erb

              </li>
              <% if current_user.shopping_cart.present? %>
---
SELECT "shopping_carts".* FROM "shopping_carts" WHERE "shopping_carts"."user_id" = 8 LIMIT 1